'use strict';

// ポケモンデータのパス
const POKEMONS_FILE = 'data/pokemons.json';

// 最大努力値
const MAX_EFFORT_VALUE = 252;

// レーダーチャート色彩
const SB_CHART_COLOR = '255, 99, 132';  // 種族値
const EV_CHART_COLOR = '54, 162, 235';  // 努力値

// ポケモン性格（無補正除く）
const NATURES = {
    // 性格名 : [上昇補正するパラメータのインデックス, 下降補正するパラメータのインデックス]
    'さみしがり' : [1, 2],
    'いじっぱり' : [1, 3],
    'やんちゃ' : [1, 4],
    'ゆうかん' : [1, 5],
    'ずぶとい' : [2, 1],
    'わんぱく' : [2, 3],
    'のうてんき' : [2, 4],
    'のんき' : [2, 5],
    'ひかえめ' : [3, 1],
    'おっとり' : [3, 2],
    'うっかりや' : [3, 4],
    'れいせい' : [3, 5],
    'おだやか' : [4, 1],
    'おとなしい' : [4, 2],
    'しんちょう' : [4, 3],
    'なまいき' : [4, 5],
    'おくびょう' : [5, 1],
    'せっかち' : [5, 2],
    'ようき' : [5, 3],
    'むじゃき' : [5, 4]
};
